{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {
    "colab_type": "text",
    "id": "view-in-github"
   },
   "source": [
    "<a href=\"https://colab.research.google.com/github/mneedham/data-science-training/blob/master/03_Recommendations.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Recommendations\n",
    "\n",
    "In this notebook we're going to learn how to make recommendations using Neo4j. As with the other notebooks, let's get our environment setup."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: py2neo in /opt/conda/lib/python3.7/site-packages (4.3.0)\n",
      "Requirement already satisfied: pandas in /opt/conda/lib/python3.7/site-packages (0.24.2)\n",
      "Requirement already satisfied: matplotlib in /opt/conda/lib/python3.7/site-packages (3.0.3)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.7/site-packages (from py2neo) (2018.9)\n",
      "Requirement already satisfied: pygments~=2.3.1 in /opt/conda/lib/python3.7/site-packages (from py2neo) (2.3.1)\n",
      "Requirement already satisfied: neobolt~=1.7.12 in /opt/conda/lib/python3.7/site-packages (from py2neo) (1.7.15)\n",
      "Requirement already satisfied: prompt-toolkit~=2.0.7 in /opt/conda/lib/python3.7/site-packages (from py2neo) (2.0.9)\n",
      "Requirement already satisfied: certifi in /opt/conda/lib/python3.7/site-packages (from py2neo) (2019.3.9)\n",
      "Requirement already satisfied: colorama in /opt/conda/lib/python3.7/site-packages (from py2neo) (0.4.1)\n",
      "Requirement already satisfied: click==7.0 in /opt/conda/lib/python3.7/site-packages (from py2neo) (7.0)\n",
      "Requirement already satisfied: neotime~=1.7.4 in /opt/conda/lib/python3.7/site-packages (from py2neo) (1.7.4)\n",
      "Requirement already satisfied: urllib3<1.25,>=1.23 in /opt/conda/lib/python3.7/site-packages (from py2neo) (1.24.1)\n",
      "Requirement already satisfied: python-dateutil>=2.5.0 in /opt/conda/lib/python3.7/site-packages (from pandas) (2.8.0)\n",
      "Requirement already satisfied: numpy>=1.12.0 in /opt/conda/lib/python3.7/site-packages (from pandas) (1.15.4)\n",
      "Requirement already satisfied: cycler>=0.10 in /opt/conda/lib/python3.7/site-packages (from matplotlib) (0.10.0)\n",
      "Requirement already satisfied: kiwisolver>=1.0.1 in /opt/conda/lib/python3.7/site-packages (from matplotlib) (1.0.1)\n",
      "Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.1 in /opt/conda/lib/python3.7/site-packages (from matplotlib) (2.4.0)\n",
      "Requirement already satisfied: wcwidth in /opt/conda/lib/python3.7/site-packages (from prompt-toolkit~=2.0.7->py2neo) (0.1.7)\n",
      "Requirement already satisfied: six>=1.9.0 in /opt/conda/lib/python3.7/site-packages (from prompt-toolkit~=2.0.7->py2neo) (1.12.0)\n",
      "Requirement already satisfied: setuptools in /opt/conda/lib/python3.7/site-packages (from kiwisolver>=1.0.1->matplotlib) (41.0.0)\n"
     ]
    }
   ],
   "source": [
    "!pip install py2neo pandas matplotlib"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And let's import those libraries:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph\n",
    "import pandas as pd\n",
    "\n",
    "import matplotlib \n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "plt.style.use('fivethirtyeight')\n",
    "pd.set_option('display.float_format', lambda x: '%.3f' % x)\n",
    "pd.set_option('display.max_colwidth', 100)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "\n",
    "Update the cell below with the same Sandbox credentials that you used in the first notebook:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Change the line of code below to use the IP Address, Bolt Port, and Password of your Sandbox.\n",
    "# graph = Graph(\"bolt://<IP Address>:<Bolt Port>\", auth=(\"neo4j\", \"<Password>\")) \n",
    "\n",
    "# graph = Graph(\"bolt://18.234.168.45:33679\", auth=(\"neo4j\", \"daybreak-cosal-rumbles\")) \n",
    "graph = Graph(\"bolt://data-science-training-neo4j\", auth=(\"neo4j\", \"admin\")) "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##  Finding popular authors\n",
    "\n",
    "Since we're going to make collaborator suggestions so let's find authors who have written the most articles so that we have some data to work with."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>articlesPublished</th>\n",
       "      <th>author.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>89</td>\n",
       "      <td>Peter G. Neumann</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>80</td>\n",
       "      <td>Peter J. Denning</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>72</td>\n",
       "      <td>Moshe Y. Vardi</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>71</td>\n",
       "      <td>Pamela Samuelson</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>65</td>\n",
       "      <td>Bart Preneel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>56</td>\n",
       "      <td>Vinton G. Cerf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>53</td>\n",
       "      <td>Barry W. Boehm</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>49</td>\n",
       "      <td>Mark Guzdial</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>47</td>\n",
       "      <td>Edwin R. Hancock</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>46</td>\n",
       "      <td>Josef Kittler</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   articlesPublished       author.name\n",
       "0                 89  Peter G. Neumann\n",
       "1                 80  Peter J. Denning\n",
       "2                 72    Moshe Y. Vardi\n",
       "3                 71  Pamela Samuelson\n",
       "4                 65      Bart Preneel\n",
       "5                 56    Vinton G. Cerf\n",
       "6                 53    Barry W. Boehm\n",
       "7                 49      Mark Guzdial\n",
       "8                 47  Edwin R. Hancock\n",
       "9                 46     Josef Kittler"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "popular_authors_query = \"\"\"\n",
    "MATCH (author:Author)\n",
    "RETURN author.name, size((author)<-[:AUTHOR]-()) AS articlesPublished\n",
    "ORDER BY articlesPublished DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "graph.run(popular_authors_query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's pick one of these authors..."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "author_name = \"Tao Xie\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "And let's have a look what articles they've published and how many citations they've received:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>article</th>\n",
       "      <th>citations</th>\n",
       "      <th>year</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>An approach to detecting duplicate bug reports using natural language and execution information</td>\n",
       "      <td>20</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Mining exception-handling rules as sequence association rules</td>\n",
       "      <td>14</td>\n",
       "      <td>2009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Inferring method specifications from natural language API descriptions</td>\n",
       "      <td>9</td>\n",
       "      <td>2012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Mining API mapping for language migration</td>\n",
       "      <td>9</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Performance debugging in the large via mining millions of stack traces</td>\n",
       "      <td>8</td>\n",
       "      <td>2012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Where do developers log? an empirical study on logging practices in industry</td>\n",
       "      <td>7</td>\n",
       "      <td>2014</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Precise identification of problems for structural test generation</td>\n",
       "      <td>7</td>\n",
       "      <td>2011</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Is operator-based mutant selection superior to random mutant selection?</td>\n",
       "      <td>4</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Teaching and learning programming and software engineering via interactive gaming</td>\n",
       "      <td>4</td>\n",
       "      <td>2013</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Automatic extraction of abstract-object-state machines from unit-test executions</td>\n",
       "      <td>4</td>\n",
       "      <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Software analytics in practice: mini tutorial</td>\n",
       "      <td>4</td>\n",
       "      <td>2012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Guided path exploration for regression test generation</td>\n",
       "      <td>3</td>\n",
       "      <td>2009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>A characteristic study on failures of production distributed data-parallel programs</td>\n",
       "      <td>3</td>\n",
       "      <td>2013</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Software intelligence: the future of mining software engineering data</td>\n",
       "      <td>3</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Locating need-to-translate constant strings for software internationalization</td>\n",
       "      <td>2</td>\n",
       "      <td>2009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Software analytics: achievements and challenges</td>\n",
       "      <td>2</td>\n",
       "      <td>2013</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>DyTa: dynamic symbolic execution guided with static verification results</td>\n",
       "      <td>1</td>\n",
       "      <td>2011</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Mining Software Engineering Data</td>\n",
       "      <td>1</td>\n",
       "      <td>2007</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Parameterized unit testing: theory and practice</td>\n",
       "      <td>1</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Future of developer testing: building quality in code</td>\n",
       "      <td>1</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                            article  \\\n",
       "0   An approach to detecting duplicate bug reports using natural language and execution information   \n",
       "1                                     Mining exception-handling rules as sequence association rules   \n",
       "2                            Inferring method specifications from natural language API descriptions   \n",
       "3                                                         Mining API mapping for language migration   \n",
       "4                            Performance debugging in the large via mining millions of stack traces   \n",
       "5                      Where do developers log? an empirical study on logging practices in industry   \n",
       "6                                 Precise identification of problems for structural test generation   \n",
       "7                           Is operator-based mutant selection superior to random mutant selection?   \n",
       "8                 Teaching and learning programming and software engineering via interactive gaming   \n",
       "9                  Automatic extraction of abstract-object-state machines from unit-test executions   \n",
       "10                                                    Software analytics in practice: mini tutorial   \n",
       "11                                           Guided path exploration for regression test generation   \n",
       "12              A characteristic study on failures of production distributed data-parallel programs   \n",
       "13                            Software intelligence: the future of mining software engineering data   \n",
       "14                    Locating need-to-translate constant strings for software internationalization   \n",
       "15                                                  Software analytics: achievements and challenges   \n",
       "16                         DyTa: dynamic symbolic execution guided with static verification results   \n",
       "17                                                                 Mining Software Engineering Data   \n",
       "18                                                  Parameterized unit testing: theory and practice   \n",
       "19                                            Future of developer testing: building quality in code   \n",
       "\n",
       "    citations  year  \n",
       "0          20  2008  \n",
       "1          14  2009  \n",
       "2           9  2012  \n",
       "3           9  2010  \n",
       "4           8  2012  \n",
       "5           7  2014  \n",
       "6           7  2011  \n",
       "7           4  2010  \n",
       "8           4  2013  \n",
       "9           4  2006  \n",
       "10          4  2012  \n",
       "11          3  2009  \n",
       "12          3  2013  \n",
       "13          3  2010  \n",
       "14          2  2009  \n",
       "15          2  2013  \n",
       "16          1  2011  \n",
       "17          1  2007  \n",
       "18          1  2010  \n",
       "19          1  2010  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "author_articles_query = \"\"\"\n",
    "MATCH (:Author {name: $authorName})<-[:AUTHOR]-(article)\n",
    "RETURN article.title AS article, article.year AS year, size((article)<-[:CITED]-()) AS citations\n",
    "ORDER BY citations DESC\n",
    "LIMIT 20\n",
    "\"\"\"\n",
    "\n",
    "graph.run(author_articles_query,  {\"authorName\": author_name}).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Find the authors collaborators..."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>coauthor</th>\n",
       "      <th>collaborations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Nikolai Tillmann</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Jonathan de Halleux</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Lu Zhang</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Xusheng Xiao</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Dongmei Zhang</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hong Mei</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Xiaoyin Wang</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Evan Martin</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Judith Bishop</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Wolfram Schulte</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              coauthor  collaborations\n",
       "0     Nikolai Tillmann              11\n",
       "1  Jonathan de Halleux               7\n",
       "2             Lu Zhang               6\n",
       "3         Xusheng Xiao               5\n",
       "4        Dongmei Zhang               5\n",
       "5             Hong Mei               4\n",
       "6         Xiaoyin Wang               4\n",
       "7          Evan Martin               4\n",
       "8        Judith Bishop               3\n",
       "9      Wolfram Schulte               3"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "collaborations_query = \"\"\"\n",
    "MATCH (:Author {name: $authorName})<-[:AUTHOR]-(article)-[:AUTHOR]->(coauthor)\n",
    "RETURN coauthor.name AS coauthor, count(*) AS collaborations\n",
    "ORDER BY collaborations DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "graph.run(collaborations_query,  {\"authorName\": author_name}).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "How would we suggest some future collaborators for this author? One way is by looking at the collaborators of their collaborators!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>coauthor</th>\n",
       "      <th>collaborations</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Mike Barnett</td>\n",
       "      <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Yingfei Xiong</td>\n",
       "      <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hongyu Zhang</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Lingming Zhang</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bing Xie</td>\n",
       "      <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Christoph Csallner</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Patrice Godefroid</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Gregg Rothermel</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Willem Visser</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Weizhong Shao</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             coauthor  collaborations\n",
       "0        Mike Barnett              37\n",
       "1       Yingfei Xiong              36\n",
       "2        Hongyu Zhang              32\n",
       "3      Lingming Zhang              32\n",
       "4            Bing Xie              30\n",
       "5  Christoph Csallner              22\n",
       "6   Patrice Godefroid              22\n",
       "7     Gregg Rothermel              22\n",
       "8       Willem Visser              22\n",
       "9       Weizhong Shao              19"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "collaborations_query = \"\"\"\n",
    "MATCH (author:Author {name: $authorName})<-[:AUTHOR]-(article)-[:AUTHOR]->(coauthor),\n",
    "      (coauthor)<-[:AUTHOR]-()-[:AUTHOR]->(coc)\n",
    "WHERE not((coc)<-[:AUTHOR]-()-[:AUTHOR]->(author)) AND coc <> author      \n",
    "RETURN coc.name AS coauthor, count(*) AS collaborations\n",
    "ORDER BY collaborations DESC\n",
    "LIMIT 10\n",
    "\"\"\"\n",
    "\n",
    "graph.run(collaborations_query,  {\"authorName\": author_name}).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "What about if an author wanted to find articles, with articles close to their own work showing up first."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<py2neo.database.Cursor at 0x7fbcb7b3b2e8>"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "CALL db.index.fulltext.createNodeIndex('articles', ['Article'], ['title', 'abstract'])\n",
    "graph.run(query)\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>article</th>\n",
       "      <th>authors</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Static detection of cross-site scripting vulnerabilities</td>\n",
       "      <td>[Zhendong Su, Gary Wassermann]</td>\n",
       "      <td>0.236</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Characterizing logging practices in open-source software</td>\n",
       "      <td>[Ding Yuan, Soyeon Park, Yuanyuan Zhou]</td>\n",
       "      <td>0.128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Automated, contract-based user testing of commercial-off-the-shelf components</td>\n",
       "      <td>[Lionel C. Briand, Yvan Labiche, Michal M. Sówka]</td>\n",
       "      <td>0.128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Concern graphs: finding and describing concerns using structural program dependencies</td>\n",
       "      <td>[Gail C. Murphy, Martin P. Robillard]</td>\n",
       "      <td>0.128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Who should fix this bug</td>\n",
       "      <td>[Lyndon Hiew, John Anvik, Gail C. Murphy]</td>\n",
       "      <td>0.128</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Conceptual module querying for software reengineering</td>\n",
       "      <td>[Gail C. Murphy, Elisa L. A. Baniassad]</td>\n",
       "      <td>0.108</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>IBM's pragmatic embrace of open source</td>\n",
       "      <td>[Pamela Samuelson]</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Open courseware and open source software</td>\n",
       "      <td>[Stefan Baldi, Anett Mehler-Bicher, Hauke Heier]</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Reusing Open-Source Software and Practices: The Impact of Open-Source on Commercial Vendors</td>\n",
       "      <td>[Alan W. Brown, Grady Booch]</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>From Research Software to Open Source</td>\n",
       "      <td>[Susan L. Graham]</td>\n",
       "      <td>0.000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                       article  \\\n",
       "0                                     Static detection of cross-site scripting vulnerabilities   \n",
       "1                                     Characterizing logging practices in open-source software   \n",
       "2                Automated, contract-based user testing of commercial-off-the-shelf components   \n",
       "3        Concern graphs: finding and describing concerns using structural program dependencies   \n",
       "4                                                                      Who should fix this bug   \n",
       "5                                        Conceptual module querying for software reengineering   \n",
       "6                                                       IBM's pragmatic embrace of open source   \n",
       "7                                                     Open courseware and open source software   \n",
       "8  Reusing Open-Source Software and Practices: The Impact of Open-Source on Commercial Vendors   \n",
       "9                                                        From Research Software to Open Source   \n",
       "\n",
       "                                             authors  score  \n",
       "0                     [Zhendong Su, Gary Wassermann]  0.236  \n",
       "1            [Ding Yuan, Soyeon Park, Yuanyuan Zhou]  0.128  \n",
       "2  [Lionel C. Briand, Yvan Labiche, Michal M. Sówka]  0.128  \n",
       "3              [Gail C. Murphy, Martin P. Robillard]  0.128  \n",
       "4          [Lyndon Hiew, John Anvik, Gail C. Murphy]  0.128  \n",
       "5            [Gail C. Murphy, Elisa L. A. Baniassad]  0.108  \n",
       "6                                 [Pamela Samuelson]  0.000  \n",
       "7   [Stefan Baldi, Anett Mehler-Bicher, Hauke Heier]  0.000  \n",
       "8                       [Alan W. Brown, Grady Booch]  0.000  \n",
       "9                                  [Susan L. Graham]  0.000  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"\"\"\n",
    "MATCH (a:Article)-[:AUTHOR]->(author:Author)\n",
    "WHERE author.name=$authorName\n",
    "WITH author, collect(a) as articles\n",
    "CALL algo.pageRank.stream(\n",
    "  'CALL db.index.fulltext.queryNodes(\"articles\", $searchTerm)\n",
    "   YIELD node, score\n",
    "   RETURN id(node) as id',\n",
    "  'MATCH (a1:Article)-[:CITED]->(a2:Article) \n",
    "   RETURN id(a1) as source,id(a2) as target', \n",
    "  {sourceNodes: articles,graph:'cypher', params: {searchTerm: $searchTerm}})\n",
    "YIELD nodeId, score\n",
    "WITH algo.getNodeById(nodeId) AS n, score\n",
    "WHERE not(exists((author)<-[:AUTHOR]-(n)))\n",
    "RETURN n.title as article, score, [(n)-[:AUTHOR]->(author) | author.name][..5] AS authors\n",
    "order by score desc limit 10\n",
    "\"\"\"\n",
    "\n",
    "params = {\"authorName\": \"Tao Xie\", \"searchTerm\": \"open source\"}\n",
    "graph.run(query, params).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>article</th>\n",
       "      <th>authors</th>\n",
       "      <th>score</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TEG: A High-Performance, Scalable, Multi-network Point-to-Point Communications Methodology</td>\n",
       "      <td>[Ralph H. Castain, Mitchel W. Sukalski, Edgar Gabriel, Graham E. Fagg, Jack Dongarra]</td>\n",
       "      <td>3.319</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Open MPI: Goals, Concept, and Design of a Next Generation MPI Implementation</td>\n",
       "      <td>[Edgar Gabriel, Vishal Sahay, Timothy S. Woodall, Jack Dongarra, Jeffrey M. Squyres]</td>\n",
       "      <td>2.870</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Concern graphs: finding and describing concerns using structural program dependencies</td>\n",
       "      <td>[Gail C. Murphy, Martin P. Robillard]</td>\n",
       "      <td>2.626</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Conceptual module querying for software reengineering</td>\n",
       "      <td>[Gail C. Murphy, Elisa L. A. Baniassad]</td>\n",
       "      <td>2.542</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Who should fix this bug</td>\n",
       "      <td>[Lyndon Hiew, John Anvik, Gail C. Murphy]</td>\n",
       "      <td>2.342</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hipikat: recommending pertinent software development artifacts</td>\n",
       "      <td>[Gail C. Murphy, Davor Cubranic]</td>\n",
       "      <td>2.205</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Version Sensitive Editing: Change History as a Programming Tool</td>\n",
       "      <td>[David L. Atkins]</td>\n",
       "      <td>2.151</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>DECKARD: Scalable and Accurate Tree-Based Detection of Code Clones</td>\n",
       "      <td>[Stéphane Glondu, Zhendong Su, Lingxiao Jiang, Ghassan Misherghi]</td>\n",
       "      <td>2.145</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Recovering documentation-to-source-code traceability links using latent semantic indexing</td>\n",
       "      <td>[Andrian Marcus, Jonathan I. Maletic]</td>\n",
       "      <td>2.006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Coverage is not strongly correlated with test suite effectiveness</td>\n",
       "      <td>[Laura Inozemtseva, Reid Holmes]</td>\n",
       "      <td>1.928</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                                                      article  \\\n",
       "0  TEG: A High-Performance, Scalable, Multi-network Point-to-Point Communications Methodology   \n",
       "1                Open MPI: Goals, Concept, and Design of a Next Generation MPI Implementation   \n",
       "2       Concern graphs: finding and describing concerns using structural program dependencies   \n",
       "3                                       Conceptual module querying for software reengineering   \n",
       "4                                                                     Who should fix this bug   \n",
       "5                              Hipikat: recommending pertinent software development artifacts   \n",
       "6                             Version Sensitive Editing: Change History as a Programming Tool   \n",
       "7                          DECKARD: Scalable and Accurate Tree-Based Detection of Code Clones   \n",
       "8   Recovering documentation-to-source-code traceability links using latent semantic indexing   \n",
       "9                           Coverage is not strongly correlated with test suite effectiveness   \n",
       "\n",
       "                                                                                 authors  \\\n",
       "0  [Ralph H. Castain, Mitchel W. Sukalski, Edgar Gabriel, Graham E. Fagg, Jack Dongarra]   \n",
       "1   [Edgar Gabriel, Vishal Sahay, Timothy S. Woodall, Jack Dongarra, Jeffrey M. Squyres]   \n",
       "2                                                  [Gail C. Murphy, Martin P. Robillard]   \n",
       "3                                                [Gail C. Murphy, Elisa L. A. Baniassad]   \n",
       "4                                              [Lyndon Hiew, John Anvik, Gail C. Murphy]   \n",
       "5                                                       [Gail C. Murphy, Davor Cubranic]   \n",
       "6                                                                      [David L. Atkins]   \n",
       "7                      [Stéphane Glondu, Zhendong Su, Lingxiao Jiang, Ghassan Misherghi]   \n",
       "8                                                  [Andrian Marcus, Jonathan I. Maletic]   \n",
       "9                                                       [Laura Inozemtseva, Reid Holmes]   \n",
       "\n",
       "   score  \n",
       "0  3.319  \n",
       "1  2.870  \n",
       "2  2.626  \n",
       "3  2.542  \n",
       "4  2.342  \n",
       "5  2.205  \n",
       "6  2.151  \n",
       "7  2.145  \n",
       "8  2.006  \n",
       "9  1.928  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "params = {\"authorName\": \"Margus Veanes\", \"searchTerm\": \"open source\"}\n",
    "graph.run(query, params).to_data_frame()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
